// 1.Ունենք զանգված կազմված բացասական, դրական թվերից և զրոյից:
// Գրել ծրագիր, որը կվերդասավորի մասիվը և կունենանք մեծից փոքր նվազող թվեր ունեցող  մասիվ:

let a = [1, -10, 52, -2, -8, 0, 999];
a = a.sort( (x, y) => y - x );
alert(a);

///////////////////////////////////////////////////////////////////////////////////////
// 2.Ունենք IT անունով "WEB","C++", "Python","C#","Java"; զանգված դարձնել  string  միավորված այս նշանով    ՞ <=> ՞:
// Տեսքը՝  <<WEB<=>C++<=>Python<=>C#<=>Java>>

let IT = ["WEB","C++", "Python","C#","Java"];
IT = IT.join('<==>');
alert(IT);

///////////////////////////////////////////////////////////////////////////////////////
// 3.Գրել ծրագիր ,որը պատահական թվով երկարություն ունեցող մասիվից կընտրի որևէ անդամ պատահական սկզբունքով:

let b = [];
const rand = (min, max) => Math.floor( Math.random() * (max - min) ) + min;
for ( let i = 1; i <= rand(1, 10); i++ ){
    b.push(i);
}
alert( b[ rand( 1, b.length - 1 ) ] );

//////////////////////////////////////////////////////////////////////////////////////
// 4.Գրել ծրագիեր, որը թույլ կտա այցելուին մուտքագրել 7 տարբեր աժեքներ, այդ արժեքներից ստանալ երկու մասիվ, որոնցից առաջինում կլինեն այն արժեքներ, որն թվեր են միաժանակ զույգ և դրական՝, մյուս  կլինի մուտգարված արժեքներից նրանք, որոնք սկսում են մեծատառ կամ փոքրատառ ՞՞h՞՞ տառով:

let array1 = [];
let array2 = [];
let data = prompt("Please insert comma separated different numbers and words");
data = data.split(',');
data = data.map( item => item.trim() );

array1 = data.filter( item => !isNaN(item) && item > 0 );
array2 = data.filter( item => item[0] == 'H' || item[0] == 'h' );

console.log(array1);
console.log(array2);

//////////////////////////////////////////////////////////////////////////////////////
// 5.Ստանալ 1-100 տիրույթում  պատահական 20 թվերից կազմված array :
// Բոլոր արժեքները հանել 1, հետո զտել բոլոր զույգ թվերը, այնուհետև ստուգել կա 0, 10, 20,30 կամ 40 արժեք ունեցող անդամ:
// Օգտագործել array-ի հետ կապված մեթեդները:

let array = [...Array(20)].map( value => Math.floor( Math.random() * 100 ) );

console.log(array);

array = array.map( item => item - 1 );

console.log(array);

array = array.filter( item => !(item % 2) );

console.log(array);

for ( let i=0; i <= 40; i+=10 ){
    if( ~array.indexOf(i) ) console.log( 'Number: ' + i + ' exists');
}